In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_15573/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

The SQL DROP TABLE Statement
- The DROP TABLE statement is used to drop an existing table in a database.

>Syntax
>
>DROP TABLE table_name;

Note: Be careful before dropping a table. Deleting a table will result in loss of complete information stored in the table!

SQL DROP TABLE Example

In [5]:
# Return data from the Customers table:
cur.execute('''CREATE TABLE testDB.ShippersOld AS SELECT * FROM testDB.Shippers;''')

3

In [6]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.ShippersOld;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ShipperID       ShipperName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

In [7]:
# The following SQL statement drops the existing table "Shippers":
cur.execute('''DROP TABLE testDB.ShippersOld;''')

0

- The PersonID column is of type int and will hold an integer.
- The LastName, FirstName, Address, and City columns are of type varchar and will hold characters, and the maximum length for these fields is 255 characters.

The empty "Persons" table will now look like this:

In [8]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.ShippersOld;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

ProgrammingError: (1146, "Table 'testdb.shippersold' doesn't exist")

In [9]:
# Return data from the Customers table:
cur.execute('''CREATE TABLE testDB.ShippersOld AS SELECT * FROM testDB.Shippers;''')

3

In [10]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.ShippersOld;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ShipperID       ShipperName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

SQL TRUNCATE TABLE
- The TRUNCATE TABLE statement is used to delete the data inside a table, but not the table itself.

>Syntax
>
>TRUNCATE TABLE table_name;

In [11]:
# Example
cur.execute('''TRUNCATE TABLE testDB.ShippersOld;''')

0

In [12]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.ShippersOld;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

  ShipperID ShipperName Phone
0